examples/outputs/emotions.mmd
graph TD
  anger["Anger"]
  anxiety["Anxiety"]
  compassion["Compassion"]
  curiosity["Curiosity"]
  excitement["Excitement"]
  fear["Fear"]
  gratitude["Gratitude"]
  hope["Hope"]
  joy["Joy"]
  love["Love"]
  sadness["Sadness"]
  shame["Shame"]

  anger --> fear
  anger --> shame
  anger --> compassion
  anger --> anxiety
  anxiety --> fear
  anxiety --> anger
  anxiety --> sadness
  anxiety --> shame
  compassion --> love
  compassion --> shame
  compassion --> anger
  curiosity --> excitement
  curiosity --> fear
  excitement --> joy
  excitement --> curiosity
  fear --> anxiety
  gratitude --> joy
  gratitude --> love
  gratitude --> anxiety
  gratitude --> hope
  hope --> sadness
  hope --> fear
  hope --> joy
  joy --> excitement
  joy --> sadness
  joy --> gratitude
  love --> compassion
  love --> joy
  love --> gratitude
  sadness --> anger
  sadness --> hope
  shame --> anger
  shame --> anxiety
  fear -.-> anger
  fear -.-> curiosity
  fear -.-> hope
  shame -.-> compassion
  anxiety -.-> gratitude
  anger -.-> sadness
  sadness -.-> anxiety
  sadness -.-> joy
  joy -.-> hope
  joy -.-> love
  hope -.-> gratitude
  anger ==> excitement
  excitement ==> anger
  anger ==> joy
  joy ==> anger
  anxiety ==> hope
  hope ==> anxiety
  compassion ==> sadness
  sadness ==> compassion
  sadness ==> shame
  shame ==> sadness
  excitement ==> gratitude
  gratitude ==> excitement
  excitement ==> hope
  hope ==> excitement
